{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_6", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_19"}, "name": "input_19", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_74", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_74", "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_66", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_66", "inbound_nodes": [[["conv2d_74", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_66", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_66", "inbound_nodes": [[["batch_normalization_66", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_75", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_75", "inbound_nodes": [[["activation_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_67", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_67", "inbound_nodes": [[["conv2d_75", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_67", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_67", "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_68", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_68", "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_76", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_76", "inbound_nodes": [[["activation_68", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_68", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_68", "inbound_nodes": [[["conv2d_76", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_69", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_69", "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_77", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_77", "inbound_nodes": [[["activation_69", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_69", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_69", "inbound_nodes": [[["conv2d_77", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_30", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_30", "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_78", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_78", "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_24", "trainable": true, "dtype": "float32"}, "name": "add_24", "inbound_nodes": [[["max_pooling2d_30", 0, 0, {}], ["conv2d_78", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_70", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_70", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_79", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_79", "inbound_nodes": [[["activation_70", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_70", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_70", "inbound_nodes": [[["conv2d_79", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_71", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_71", "inbound_nodes": [[["batch_normalization_70", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_80", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_80", "inbound_nodes": [[["activation_71", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_71", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_71", "inbound_nodes": [[["conv2d_80", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_31", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_31", "inbound_nodes": [[["batch_normalization_71", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_81", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_81", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_25", "trainable": true, "dtype": "float32"}, "name": "add_25", "inbound_nodes": [[["max_pooling2d_31", 0, 0, {}], ["conv2d_81", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_72", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_72", "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_82", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_82", "inbound_nodes": [[["activation_72", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_72", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_72", "inbound_nodes": [[["conv2d_82", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_73", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_73", "inbound_nodes": [[["batch_normalization_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_83", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_83", "inbound_nodes": [[["activation_73", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_73", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_73", "inbound_nodes": [[["conv2d_83", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_32", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_32", "inbound_nodes": [[["batch_normalization_73", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_84", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_84", "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "name": "add_26", "inbound_nodes": [[["max_pooling2d_32", 0, 0, {}], ["conv2d_84", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_74", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_74", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_85", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_85", "inbound_nodes": [[["activation_74", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_74", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_74", "inbound_nodes": [[["conv2d_85", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_75", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_75", "inbound_nodes": [[["batch_normalization_74", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_86", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_86", "inbound_nodes": [[["activation_75", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_75", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_75", "inbound_nodes": [[["conv2d_86", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_33", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_33", "inbound_nodes": [[["batch_normalization_75", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_87", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_87", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_27", "trainable": true, "dtype": "float32"}, "name": "add_27", "inbound_nodes": [[["max_pooling2d_33", 0, 0, {}], ["conv2d_87", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_88", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_88", "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_76", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_76", "inbound_nodes": [[["conv2d_88", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_76", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_76", "inbound_nodes": [[["batch_normalization_76", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_9", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d_9", "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["global_average_pooling2d_9", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0]], "output_layers": [["dense_16", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "acc", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of20.bin", "group1-shard2of20.bin", "group1-shard3of20.bin", "group1-shard4of20.bin", "group1-shard5of20.bin", "group1-shard6of20.bin", "group1-shard7of20.bin", "group1-shard8of20.bin", "group1-shard9of20.bin", "group1-shard10of20.bin", "group1-shard11of20.bin", "group1-shard12of20.bin", "group1-shard13of20.bin", "group1-shard14of20.bin", "group1-shard15of20.bin", "group1-shard16of20.bin", "group1-shard17of20.bin", "group1-shard18of20.bin", "group1-shard19of20.bin", "group1-shard20of20.bin"], "weights": [{"name": "batch_normalization_66/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_66/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_66/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_66/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_67/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_67/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_67/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_67/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_68/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_68/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_68/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_68/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_69/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_69/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_69/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_69/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_70/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_70/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_70/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_70/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_71/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_71/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_71/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_71/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_72/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_72/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_72/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_72/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_73/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_73/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_73/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_73/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_74/gamma", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_74/beta", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_74/moving_mean", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_74/moving_variance", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_75/gamma", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_75/beta", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_75/moving_mean", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_75/moving_variance", "shape": [728], "dtype": "float32"}, {"name": "batch_normalization_76/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_76/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_76/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_76/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_74/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_74/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_75/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_75/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_76/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_76/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_77/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_77/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_78/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_78/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_79/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_79/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_80/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_80/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_81/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv2d_81/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_82/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_82/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_83/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_83/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_84/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv2d_84/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_85/kernel", "shape": [3, 3, 512, 728], "dtype": "float32"}, {"name": "conv2d_85/bias", "shape": [728], "dtype": "float32"}, {"name": "conv2d_86/kernel", "shape": [3, 3, 728, 728], "dtype": "float32"}, {"name": "conv2d_86/bias", "shape": [728], "dtype": "float32"}, {"name": "conv2d_87/kernel", "shape": [1, 1, 512, 728], "dtype": "float32"}, {"name": "conv2d_87/bias", "shape": [728], "dtype": "float32"}, {"name": "conv2d_88/kernel", "shape": [3, 3, 728, 1024], "dtype": "float32"}, {"name": "conv2d_88/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [1024, 4], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [4], "dtype": "float32"}]}]}